GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/system_fm33lr0xx.h
/**************************************************************************//**
 * @file     system_fm33lr0xx.h
 * @brief    CMSIS Cortex-M0 Device Peripheral Access Layer Header File for
 *           Device FM33LR0XX
 * @version  V1.0.5
 * @date     29. June 2025
 *
 * @note
 *
 ******************************************************************************/
#ifndef SYSTEM_FM33LR0XX_H
#define SYSTEM_FM33LR0XX_H

#ifdef __cplusplus
extern "C" {
#endif

/**
  * @brief CMSIS Device version number
  */
#define __FM33LR0xx_CMSIS_VERSION_MAIN      (0x01) /*!< [31:24] main version */
#define __FM33LR0xx_CMSIS_VERSION_SUB1      (0x00) /*!< [23:16] sub1 version */
#define __FM33LR0xx_CMSIS_VERSION_SUB2      (0x00) /*!< [15:0]  sub2 version */
#define __FM33LR0xx_CMSIS_VERSION           ((__FM33LR0xx_CMSIS_VERSION_MAIN  << 24)\
                                             |(__FM33LR0xx_CMSIS_VERSION_SUB1 << 16)\
                                             |(__FM33LR0xx_CMSIS_VERSION_SUB2))

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>

/* Device Includes -----------------------------------------------------------*/
#include "fm33lr0xx.h"

/* Trim Values ---------------------------------------------------------------*/
/* Validate Function */
#define LDT_CHECK(_N_VALUE_, _T_VALUE_)                         \
                            ((((_N_VALUE_ >> 16) & 0xffff) ==   \
                            ((~_N_VALUE_) & 0xffff)) ? _N_VALUE_ : _T_VALUE_)

/* Trim Values Address */
#define RCLP_LDT_TRIM       (*(uint32_t *)0x1FFFFD20)   // RCLP 常温校准值
#define RCHF8M_LDT_TRIM     (*(uint32_t *)0x1FFFFD40)   // RC8M 常温校准值
#define RCHF16M_LDT_TRIM    (*(uint32_t *)0x1FFFFD44)   // RC16M 常温校准值
#define RCHF24M_LDT_TRIM    (*(uint32_t *)0x1FFFFD48)   // RC24M 常温校准值
#define RCHF32M_LDT_TRIM    (*(uint32_t *)0x1FFFFD4C)   // RC32M 常温校准值

/* Trim Values */
#define RCLP_TRIM           (LDT_CHECK(RCLP_LDT_TRIM, 0x80) & 0xff)
#define RCHF8M_TRIM         (LDT_CHECK(RCHF8M_LDT_TRIM, 0x80) & 0xff)
#define RCHF16M_TRIM        (LDT_CHECK(RCHF16M_LDT_TRIM, 0x80) & 0xff)
#define RCHF24M_TRIM        (LDT_CHECK(RCHF24M_LDT_TRIM, 0x80) & 0xff)
#define RCHF32M_TRIM        (LDT_CHECK(RCHF32M_LDT_TRIM, 0x80) & 0xff)

/**
  * @}
  */

//BIT MAP======================================================
#define BIT0            0x00000001U
#define BIT1            0x00000002U
#define BIT2            0x00000004U
#define BIT3            0x00000008U
#define BIT4            0x00000010U
#define BIT5            0x00000020U
#define BIT6            0x00000040U
#define BIT7            0x00000080U
#define BIT8            0x00000100U
#define BIT9            0x00000200U
#define BIT10           0x00000400U
#define BIT11           0x00000800U
#define BIT12           0x00001000U
#define BIT13           0x00002000U
#define BIT14           0x00004000U
#define BIT15           0x00008000U
#define BIT16           0x00010000U
#define BIT17           0x00020000U
#define BIT18           0x00040000U
#define BIT19           0x00080000U
#define BIT20           0x00100000U
#define BIT21           0x00200000U
#define BIT22           0x00400000U
#define BIT23           0x00800000U
#define BIT24           0x01000000U
#define BIT25           0x02000000U
#define BIT26           0x04000000U
#define BIT27           0x08000000U
#define BIT28           0x10000000U
#define BIT29           0x20000000U
#define BIT30           0x40000000U
#define BIT31           0x80000000U
#define BITNO           0x00000000U    

/**
  * @}
  */

/* Bitfield macro definitions for various peripherals --------------------------------------------*/
/* CMU start --------------------------------------------*/
#define    CMU_SYSCLKCR_SYSC_SWLOC_Pos                            (31U)
#define    CMU_SYSCLKCR_SYSC_SWLOC_Msk                            (0x1U << CMU_SYSCLKCR_SYSC_SWLOC_Pos)
#define    CMU_SYSCLKCR_SYSC_SWLOC                                CMU_SYSCLKCR_SYSC_SWLOC_Msk

#define    CMU_SYSCLKCR_SLP_ENEXTI_Pos                            (25U)
#define    CMU_SYSCLKCR_SLP_ENEXTI_Msk                            (0x1U << CMU_SYSCLKCR_SLP_ENEXTI_Pos)
#define    CMU_SYSCLKCR_SLP_ENEXTI                                CMU_SYSCLKCR_SLP_ENEXTI_Msk

#define    CMU_SYSCLKCR_CKSAFE_CFG_Pos                            (24U)
#define    CMU_SYSCLKCR_CKSAFE_CFG_Msk                            (0x1U << CMU_SYSCLKCR_CKSAFE_CFG_Pos)
#define    CMU_SYSCLKCR_CKSAFE_CFG                                CMU_SYSCLKCR_CKSAFE_CFG_Msk

#define    CMU_SYSCLKCR_APBPRES_Pos                               (16U)
#define    CMU_SYSCLKCR_APBPRES_Msk                               (0x7U << CMU_SYSCLKCR_APBPRES_Pos)
#define    CMU_SYSCLKCR_APBPRES                                   CMU_SYSCLKCR_APBPRES_Msk

#define    CMU_SYSCLKCR_AHBPRES_WKUPRST_Pos                       (12U)
#define    CMU_SYSCLKCR_AHBPRES_WKUPRST_Msk                       (0x1U << CMU_SYSCLKCR_AHBPRES_WKUPRST_Pos)
#define    CMU_SYSCLKCR_AHBPRES_WKUPRST                           CMU_SYSCLKCR_AHBPRES_WKUPRST_Msk

#define    CMU_SYSCLKCR_AHBPRES_Pos                               (8U)
#define    CMU_SYSCLKCR_AHBPRES_Msk                               (0x7U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    CMU_SYSCLKCR_AHBPRES                                   CMU_SYSCLKCR_AHBPRES_Msk

#define    CMU_SYSCLKCR_STCLKSEL_Pos                              (6U)
#define    CMU_SYSCLKCR_STCLKSEL_Msk                              (0x3U << CMU_SYSCLKCR_STCLKSEL_Pos)
#define    CMU_SYSCLKCR_STCLKSEL                                  CMU_SYSCLKCR_STCLKSEL_Msk

#define    CMU_SYSCLKCR_SYSCLKSEL_Pos                             (0U)
#define    CMU_SYSCLKCR_SYSCLKSEL_Msk                             (0x7U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    CMU_SYSCLKCR_SYSCLKSEL                                 CMU_SYSCLKCR_SYSCLKSEL_Msk

#define    CMU_RCHFCR_FSEL_Pos                                    (16U)
#define    CMU_RCHFCR_FSEL_Msk                                    (0xfU << CMU_RCHFCR_FSEL_Pos)
#define    CMU_RCHFCR_FSEL                                        CMU_RCHFCR_FSEL_Msk

