GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/system_fm33lr0xx.h
#define    FL_ADC_CH_SAMPLING_TIME_4_ADCCLK                       (0x0U << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_6_ADCCLK                       (0x1U << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_8_ADCCLK                       (0x2U << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_12_ADCCLK                      (0x3U << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_16_ADCCLK                      (0x4U << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_32_ADCCLK                      (0x5U << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_64_ADCCLK                      (0x6U << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_80_ADCCLK                      (0x7U << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_96_ADCCLK                      (0x8U << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_128_ADCCLK                     (0x9U << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_160_ADCCLK                     (0xaU << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_192_ADCCLK                     (0xbU << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_256_ADCCLK                     (0xcU << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_320_ADCCLK                     (0xdU << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_384_ADCCLK                     (0xeU << ADC_SMTR_SMTS_Pos)
#define    FL_ADC_CH_SAMPLING_TIME_512_ADCCLK                     (0xfU << ADC_SMTR_SMTS_Pos)
/* ADC end --------------------------------------------*/

/* BSTIM start --------------------------------------------*/
#define    BSTIM16_CR1_ARPE_Pos                                   (7U)
#define    BSTIM16_CR1_ARPE_Msk                                   (0x1U << BSTIM16_CR1_ARPE_Pos)
#define    BSTIM16_CR1_ARPE                                       BSTIM16_CR1_ARPE_Msk

#define    BSTIM16_CR1_OPM_Pos                                    (3U)
#define    BSTIM16_CR1_OPM_Msk                                    (0x1U << BSTIM16_CR1_OPM_Pos)
#define    BSTIM16_CR1_OPM                                        BSTIM16_CR1_OPM_Msk

#define    BSTIM16_CR1_URS_Pos                                    (2U)
#define    BSTIM16_CR1_URS_Msk                                    (0x1U << BSTIM16_CR1_URS_Pos)
#define    BSTIM16_CR1_URS                                        BSTIM16_CR1_URS_Msk

#define    BSTIM16_CR1_UDIS_Pos                                   (1U)
#define    BSTIM16_CR1_UDIS_Msk                                   (0x1U << BSTIM16_CR1_UDIS_Pos)
#define    BSTIM16_CR1_UDIS                                       BSTIM16_CR1_UDIS_Msk

#define    BSTIM16_CR1_CEN_Pos                                    (0U)
#define    BSTIM16_CR1_CEN_Msk                                    (0x1U << BSTIM16_CR1_CEN_Pos)
#define    BSTIM16_CR1_CEN                                        BSTIM16_CR1_CEN_Msk

#define    BSTIM16_CR2_MMS_Pos                                    (4U)
#define    BSTIM16_CR2_MMS_Msk                                    (0x7U << BSTIM16_CR2_MMS_Pos)
#define    BSTIM16_CR2_MMS                                        BSTIM16_CR2_MMS_Msk

#define    BSTIM16_IER_UIE_Pos                                    (0U)
#define    BSTIM16_IER_UIE_Msk                                    (0x1U << BSTIM16_IER_UIE_Pos)
#define    BSTIM16_IER_UIE                                        BSTIM16_IER_UIE_Msk

#define    BSTIM16_ISR_UIF_Pos                                    (0U)
#define    BSTIM16_ISR_UIF_Msk                                    (0x1U << BSTIM16_ISR_UIF_Pos)
#define    BSTIM16_ISR_UIF                                        BSTIM16_ISR_UIF_Msk

#define    BSTIM16_EGR_UG_Pos                                     (0U)
#define    BSTIM16_EGR_UG_Msk                                     (0x1U << BSTIM16_EGR_UG_Pos)
#define    BSTIM16_EGR_UG                                         BSTIM16_EGR_UG_Msk

#define    FL_BSTIM16_ONE_PULSE_MODE_CONTINUOUS                   (0x0U << BSTIM16_CR1_OPM_Pos)
#define    FL_BSTIM16_ONE_PULSE_MODE_SINGLE                       (0x1U << BSTIM16_CR1_OPM_Pos)


#define    FL_BSTIM16_UPDATE_SOURCE_REGULAR                       (0x0U << BSTIM16_CR1_URS_Pos)
#define    FL_BSTIM16_UPDATE_SOURCE_COUNTER                       (0x1U << BSTIM16_CR1_URS_Pos)

#define    FL_BSTIM16_TRGO_UG                                     (0x0U << BSTIM16_CR2_MMS_Pos)
#define    FL_BSTIM16_TRGO_ENABLE                                 (0x1U << BSTIM16_CR2_MMS_Pos)
#define    FL_BSTIM16_TRGO_UPDATE                                 (0x2U << BSTIM16_CR2_MMS_Pos)
/* BSTIM end --------------------------------------------*/

/* FLASH start --------------------------------------------*/
#define    FLASH_RDCR_CODE_WAIT_Pos                               (0U)
#define    FLASH_RDCR_CODE_WAIT_Msk                               (0x3U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FLASH_RDCR_CODE_WAIT                                   FLASH_RDCR_CODE_WAIT_Msk

#define    FLASH_PFTCON_EN_Pos                                    (0U)
#define    FLASH_PFTCON_EN_Msk                                    (0x1U << FLASH_PFTCON_EN_Pos)
#define    FLASH_PFTCON_EN                                        FLASH_PFTCON_EN_Msk

#define    FLASH_OPTBR_IWDTSLP_Pos                                (31U)
#define    FLASH_OPTBR_IWDTSLP_Msk                                (0x1U << FLASH_OPTBR_IWDTSLP_Pos)
#define    FLASH_OPTBR_IWDTSLP                                    FLASH_OPTBR_IWDTSLP_Msk

#define    FLASH_OPTBR_IWDTEN_Pos                                 (30U)
#define    FLASH_OPTBR_IWDTEN_Msk                                 (0x1U << FLASH_OPTBR_IWDTEN_Pos)
#define    FLASH_OPTBR_IWDTEN                                     FLASH_OPTBR_IWDTEN_Msk

#define    FLASH_OPTBR_ACLOCKEN_Pos                               (2U)
#define    FLASH_OPTBR_ACLOCKEN_Msk                               (0x3U << FLASH_OPTBR_ACLOCKEN_Pos)
#define    FLASH_OPTBR_ACLOCKEN                                   FLASH_OPTBR_ACLOCKEN_Msk

#define    FLASH_OPTBR_DBRDPEN_Pos                                (0U)
#define    FLASH_OPTBR_DBRDPEN_Msk                                (0x3U << FLASH_OPTBR_DBRDPEN_Pos)
#define    FLASH_OPTBR_DBRDPEN                                    FLASH_OPTBR_DBRDPEN_Msk

#define    FLASH_EPCR_ERTYPE_Pos                                  (8U)
#define    FLASH_EPCR_ERTYPE_Msk                                  (0x3U << FLASH_EPCR_ERTYPE_Pos)
#define    FLASH_EPCR_ERTYPE                                      FLASH_EPCR_ERTYPE_Msk

#define    FLASH_EPCR_PREQ_Pos                                    (1U)
#define    FLASH_EPCR_PREQ_Msk                                    (0x1U << FLASH_EPCR_PREQ_Pos)
#define    FLASH_EPCR_PREQ                                        FLASH_EPCR_PREQ_Msk

#define    FLASH_EPCR_EREQ_Pos                                    (0U)
#define    FLASH_EPCR_EREQ_Msk                                    (0x1U << FLASH_EPCR_EREQ_Pos)
#define    FLASH_EPCR_EREQ                                        FLASH_EPCR_EREQ_Msk

#define    FLASH_IER_AUTHIE_Pos                                   (10U)
#define    FLASH_IER_AUTHIE_Msk                                   (0x1U << FLASH_IER_AUTHIE_Pos)
#define    FLASH_IER_AUTHIE                                       FLASH_IER_AUTHIE_Msk

#define    FLASH_IER_KEYIE_Pos                                    (9U)
#define    FLASH_IER_KEYIE_Msk                                    (0x1U << FLASH_IER_KEYIE_Pos)
#define    FLASH_IER_KEYIE                                        FLASH_IER_KEYIE_Msk

#define    FLASH_IER_CKIE_Pos                                     (8U)
#define    FLASH_IER_CKIE_Msk                                     (0x1U << FLASH_IER_CKIE_Pos)
#define    FLASH_IER_CKIE                                         FLASH_IER_CKIE_Msk

