GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/system_fm33lr0xx.h
#define    FLASH_IER_PRDIE_Pos                                    (1U)
#define    FLASH_IER_PRDIE_Msk                                    (0x1U << FLASH_IER_PRDIE_Pos)
#define    FLASH_IER_PRDIE                                        FLASH_IER_PRDIE_Msk

#define    FLASH_IER_ERDIE_Pos                                    (0U)
#define    FLASH_IER_ERDIE_Msk                                    (0x1U << FLASH_IER_ERDIE_Pos)
#define    FLASH_IER_ERDIE                                        FLASH_IER_ERDIE_Msk

#define    FLASH_ISR_KEYSTA_Pos                                   (17U)
#define    FLASH_ISR_KEYSTA_Msk                                   (0x7U << FLASH_ISR_KEYSTA_Pos)
#define    FLASH_ISR_KEYSTA                                       FLASH_ISR_KEYSTA_Msk

#define    FLASH_ISR_AUTHERR_Pos                                  (10U)
#define    FLASH_ISR_AUTHERR_Msk                                  (0x1U << FLASH_ISR_AUTHERR_Pos)
#define    FLASH_ISR_AUTHERR                                      FLASH_ISR_AUTHERR_Msk

#define    FLASH_ISR_KEYERR_Pos                                   (9U)
#define    FLASH_ISR_KEYERR_Msk                                   (0x1U << FLASH_ISR_KEYERR_Pos)
#define    FLASH_ISR_KEYERR                                       FLASH_ISR_KEYERR_Msk

#define    FLASH_ISR_CKERR_Pos                                    (8U)
#define    FLASH_ISR_CKERR_Msk                                    (0x1U << FLASH_ISR_CKERR_Pos)
#define    FLASH_ISR_CKERR                                        FLASH_ISR_CKERR_Msk

#define    FLASH_ISR_PRD_Pos                                      (1U)
#define    FLASH_ISR_PRD_Msk                                      (0x1U << FLASH_ISR_PRD_Pos)
#define    FLASH_ISR_PRD                                          FLASH_ISR_PRD_Msk

#define    FLASH_ISR_ERD_Pos                                      (0U)
#define    FLASH_ISR_ERD_Msk                                      (0x1U << FLASH_ISR_ERD_Pos)
#define    FLASH_ISR_ERD                                          FLASH_ISR_ERD_Msk

#define    FLASH_ERRIER_IE_Pos                                    (2U)
#define    FLASH_ERRIER_IE_Msk                                    (0x1U << FLASH_ERRIER_IE_Pos)
#define    FLASH_ERRIER_IE                                        FLASH_ERRIER_IE_Msk


#define    FLASH_ECCSR_PERDD_Pos                                  (31U)
#define    FLASH_ECCSR_PERDD_Msk                                  (0x1U << FLASH_ECCSR_PERDD_Pos)
#define    FLASH_ECCSR_PERDD                                      FLASH_ECCSR_PERDD_Msk

#define    FLASH_ECCSR_DC_Pos                                     (29U)
#define    FLASH_ECCSR_DC_Msk                                     (0x1U << FLASH_ECCSR_DC_Pos)
#define    FLASH_ECCSR_DC                                         FLASH_ECCSR_DC_Msk

#define    FLASH_ECCSR_CC_Pos                                     (28U)
#define    FLASH_ECCSR_CC_Msk                                     (0x1U << FLASH_ECCSR_CC_Pos)
#define    FLASH_ECCSR_CC                                         FLASH_ECCSR_CC_Msk

#define    FLASH_ECCSR_BE_Pos                                     (27U)
#define    FLASH_ECCSR_BE_Msk                                     (0x1U << FLASH_ECCSR_BE_Pos)
#define    FLASH_ECCSR_BE                                         FLASH_ECCSR_BE_Msk

#define    FLASH_ECCSR_CIE_Pos                                    (24U)
#define    FLASH_ECCSR_CIE_Msk                                    (0x1U << FLASH_ECCSR_CIE_Pos)
#define    FLASH_ECCSR_CIE                                        FLASH_ECCSR_CIE_Msk

#define    FLASH_ECCSR_FLS_SEL_Pos                                (15U)
#define    FLASH_ECCSR_FLS_SEL_Msk                                (0x1U << FLASH_ECCSR_FLS_SEL_Pos)
#define    FLASH_ECCSR_FLS_SEL                                     FLASH_ECCSR_FLS_SEL_Msk

#define    FLASH_ECCSR_ADDR_Pos                                   (0U)
#define    FLASH_ECCSR_ADDR_Msk                                   (0x7fffU << FLASH_ECCSR_ADDR_Pos)
#define    FLASH_ECCSR_ADDR                                       FLASH_ECCSR_ADDR_Msk

#define    FL_FLASH_ERASE_KEY                                    (0x96969696U)
#define    FL_FLASH_CHIP_ERASE_KEY                               (0x7D7D7D7DU)
#define    FL_FLASH_PAGE_ERASE_KEY                               (0xEAEAEAEAU)
#define    FL_FLASH_SECTOR_ERASE_KEY                             (0x3C3C3C3CU)
#define    FL_FLASH_ERASE_REQUEST                                (0x1234ABCDU)
#define    FL_FLASH_PROGRAM_KEY1                                 (0xA5A5A5A5U)
#define    FL_FLASH_PROGRAM_KEY2                                 (0xF1F1F1F1U)

#define    FL_FLASH_ERASE_TIMEOUT                                (0x0000FFFFU)
#define    FL_FLASH_ADDRS_ALIGN                                  (0x00000004U)

#define    FL_FLASH_MAX_PAGE_NUM                                 (0x00000100U)
#define    FL_FLASH_MAX_SECTOR_NUM                               (0x00000040U)
#define    FL_FLASH_SECTOR_SIZE_BYTE                             (0x00000800U)
#define    FL_FLASH_PAGE_SIZE_BYTE                               (0x00000200U)
#define    FL_FLASH_ADDR_MAXPROGRAM                              (0x0005FFFFU)

#define    FL_CODE_FLASH_MAX_PAGE_NUM                            (0x00000300U)
#define    FL_CODE_FLASH_MAX_SECTOR_NUM                          (0x000000C0U)
#define    FL_CODE_FLASH_SECTOR_SIZE_BYTE                        (0x00000800U)
#define    FL_CODE_FLASH_PAGE_SIZE_BYTE                          (0x00000200U)
#define    FL_CODE_FLASH_ADDR_MAXPROGRAM                         (0x0001FFFFU)

#define    FL_DATA_FLASH_MAX_PAGE_NUM                            (0x0050001DU)
#define    FL_DATA_FLASH_MIN_PAGE_NUM                            (0x00500000U)
#define    FL_DATA_FLASH_MAX_SECTOR_NUM                          (0x00140008U)
#define    FL_DATA_FLASH_MIN_SECTOR_NUM                          (0x00140000U)
#define    FL_DATA_FLASH_SECTOR_SIZE_BYTE                        (0x00000800U)
#define    FL_DATA_FLASH_PAGE_SIZE_BYTE                          (0x00000200U)
#define    FL_DATA_FLASH_ADDR_MAXPROGRAM                         (0xA0003A00U)
#define    FL_DATA_FLASH_ADDR_MINPROGRAM                         (0xA0000000U)

#define    FL_FLASH_INFORMATION1_REGIN                            (0x1U << 17U)
#define    FL_FLASH_INFORMATION2_REGIN                            (0x1U << 18U)
#define    FL_FLASH_BLOCK_0                                       (0x1U << 0U)
#define    FL_FLASH_BLOCK_1                                       (0x1U << 1U)
#define    FL_FLASH_BLOCK_2                                       (0x1U << 2U)
#define    FL_FLASH_BLOCK_3                                       (0x1U << 3U)
#define    FL_FLASH_BLOCK_4                                       (0x1U << 4U)
#define    FL_FLASH_BLOCK_5                                       (0x1U << 5U)
#define    FL_FLASH_BLOCK_6                                       (0x1U << 6U)
#define    FL_FLASH_BLOCK_7                                       (0x1U << 7U)
#define    FL_FLASH_BLOCK_8                                       (0x1U << 8U)
#define    FL_FLASH_BLOCK_9                                       (0x1U << 9U)
#define    FL_FLASH_BLOCK_10                                      (0x1U << 10U)
#define    FL_FLASH_BLOCK_11                                      (0x1U << 11U)
#define    FL_FLASH_BLOCK_12                                      (0x1U << 12U)
#define    FL_FLASH_BLOCK_13                                      (0x1U << 13U)
#define    FL_FLASH_BLOCK_14                                      (0x1U << 14U)
#define    FL_FLASH_BLOCK_15                                      (0x1U << 15U)
#define    FL_FLASH_LOCK_ALL                                      (0x0U << 0U)
#define    FL_FLASH_LOCK_SOFTWARE                                 (0x2U << 0U)
#define    FL_FLASH_LOCK_NONE                                     (0x3U << 0U)
#define    FL_FLASH_APPCODE_LOCK_ENABLE                           (0x2U << 2U)
#define    FL_FLASH_APPCODE_LOCK_DISABLE                          (0x0U << 2U)
#define    FL_FLASH_DEBUG_READ_ENABLE                             (0x2U << 0U)
#define    FL_FLASH_DEBUG_READ_DISABLE                            (0x0U << 0U)

#define    FL_FLASH_READ_CODEWAIT_0CYCLE                          (0x0U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_1CYCLE                          (0x1U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_2CYCLE                          (0x2U << FLASH_RDCR_CODE_WAIT_Pos)
#define    FL_FLASH_READ_CODEWAIT_3CYCLE                          (0x3U << FLASH_RDCR_CODE_WAIT_Pos)

#define    FL_FLASH_IWDT_STOP_UNDER_SLEEP                         (0x0U << FLASH_OPTBR_IWDTSLP_Pos)
#define    FL_FLASH_IWDT_WORK_UNDER_SLEEP                         (0x1U << FLASH_OPTBR_IWDTSLP_Pos)

#define    FL_FLASH_IWDT_STOP_AFTERPOWERON                        (0x0U << FLASH_OPTBR_IWDTEN_Pos)
#define    FL_FLASH_IWDT_WORK_AFTERPOWERON                        (0x1U << FLASH_OPTBR_IWDTEN_Pos)

#define    FL_FLASH_FLASH_LOCK_DISABLE                            (0x0U << FLASH_OPTBR_ACLOCKEN_Pos)
#define    FL_FLASH_FLASH_LOCK_ENABLE                             (0x2U << FLASH_OPTBR_ACLOCKEN_Pos)

#define    FL_FLASH_SWD_READ_PEOTECTION_DISABLE                   (0x0U << FLASH_OPTBR_DBRDPEN_Pos)
#define    FL_FLASH_SWD_READ_PEOTECTION_ENABLE                    (0x2U << FLASH_OPTBR_DBRDPEN_Pos)

#define    FL_FLASH_ERASE_TYPE_PAGE                               (0x0U << FLASH_EPCR_ERTYPE_Pos)
#define    FL_FLASH_ERASE_TYPE_SECTOR                             (0x1U << FLASH_EPCR_ERTYPE_Pos)

#define    FL_FLASH_KEY_STATUS_LOCK                               (0x0U << FLASH_ISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_ALL_ERASE                          (0x1U << FLASH_ISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_PAGE_ERASE                         (0x2U << FLASH_ISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_PROGRAM                            (0x3U << FLASH_ISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_ERROR                              (0x4U << FLASH_ISR_KEYSTA_Pos)
#define    FL_FLASH_KEY_STATUS_SECTOR_ERASE                       (0x5U << FLASH_ISR_KEYSTA_Pos)
/* FLASH end --------------------------------------------*/

