GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/system_fm33lr0xx.h
/* GPIO start --------------------------------------------*/
#define    GPIO_PUDEN_PUD_Pos                                     (16U)
#define    GPIO_PUDEN_PUD_Msk                                     (0x1U << GPIO_PUDEN_PUD_Pos)
#define    GPIO_PUDEN_PUD                                         GPIO_PUDEN_PUD_Msk

#define    GPIO_PUDEN_PUDEN_Pos                                   (0U)
#define    GPIO_PUDEN_PUDEN_Msk                                   (0x1U << GPIO_PUDEN_PUDEN_Pos)
#define    GPIO_PUDEN_PUDEN                                       GPIO_PUDEN_PUDEN_Msk

#define    GPIO_FCR_Pos                                           (0U)
#define    GPIO_FCR_Msk                                           (0x3U << GPIO_FCR_Pos)
#define    GPIO_FCR                                               GPIO_FCR_Msk

#define    GPIO_DFS_Pos                                           (0U)
#define    GPIO_DFS_Msk                                           (0x3U << GPIO_DFS_Pos)
#define    GPIO_DFS                                               GPIO_DFS_Msk

#define    GPIO_SRDR_DR_Pos                                       (0U)
#define    GPIO_SRDR_DR_Msk                                       (0x1U << GPIO_SRDR_DR_Pos)
#define    GPIO_SRDR_DR                                            GPIO_SRDR_DR_Msk

#define    GPIO_SRDR_SR_Pos                                       (16U)
#define    GPIO_SRDR_SR_Msk                                       (0x1U << GPIO_SRDR_SR_Pos)
#define    GPIO_SRDR_SR                                            GPIO_SRDR_SR_Msk

#define    GPIO_TMUXR_PC7TMUX_Pos                                 (14U)
#define    GPIO_TMUXR_PC7TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC7TMUX_Pos)
#define    GPIO_TMUXR_PC7TMUX                                     GPIO_TMUXR_PC7TMUX_Msk

#define    GPIO_TMUXR_PC6TMUX_Pos                                 (12U)
#define    GPIO_TMUXR_PC6TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC6TMUX_Pos)
#define    GPIO_TMUXR_PC6TMUX                                     GPIO_TMUXR_PC6TMUX_Msk

#define    GPIO_TMUXR_PC5TMUX_Pos                                 (10U)
#define    GPIO_TMUXR_PC5TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC5TMUX_Pos)
#define    GPIO_TMUXR_PC5TMUX                                     GPIO_TMUXR_PC5TMUX_Msk

#define    GPIO_TMUXR_PC4TMUX_Pos                                 (8U)
#define    GPIO_TMUXR_PC4TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC4TMUX_Pos)
#define    GPIO_TMUXR_PC4TMUX                                     GPIO_TMUXR_PC4TMUX_Msk

#define    GPIO_TMUXR_PC3TMUX_Pos                                 (6U)
#define    GPIO_TMUXR_PC3TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC3TMUX_Pos)
#define    GPIO_TMUXR_PC3TMUX                                     GPIO_TMUXR_PC3TMUX_Msk

#define    GPIO_TMUXR_PC2TMUX_Pos                                 (4U)
#define    GPIO_TMUXR_PC2TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC2TMUX_Pos)
#define    GPIO_TMUXR_PC2TMUX                                     GPIO_TMUXR_PC2TMUX_Msk

#define    GPIO_TMUXR_PC1TMUX_Pos                                 (2U)
#define    GPIO_TMUXR_PC1TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC1TMUX_Pos)
#define    GPIO_TMUXR_PC1TMUX                                     GPIO_TMUXR_PC1TMUX_Msk

#define    GPIO_EXTIEDS0_Pos                                      (0U)
#define    GPIO_EXTIEDS0_Msk                                      (0x3U << GPIO_EXTIEDS0_Pos)
#define    GPIO_EXTIEDS0                                          GPIO_EXTIEDS0_Msk

#define    GPIO_EXTIEDS1_Pos                                      (0U)
#define    GPIO_EXTIEDS1_Msk                                      (0x3U << GPIO_EXTIEDS1_Pos)
#define    GPIO_EXTIEDS1                                          GPIO_EXTIEDS1_Msk

#define    GPIO_FOUTSEL_FOUT0_Pos                                 (0U)
#define    GPIO_FOUTSEL_FOUT0_Msk                                 (0xfU << GPIO_FOUTSEL_FOUT0_Pos)
#define    GPIO_FOUTSEL_FOUT0                                     GPIO_FOUTSEL_FOUT0_Msk

#define    GPIO_FOUTSEL_FOUT1_Pos                                 (4U)
#define    GPIO_FOUTSEL_FOUT1_Msk                                 (0xfU << GPIO_FOUTSEL_FOUT1_Pos)
#define    GPIO_FOUTSEL_FOUT1                                     GPIO_FOUTSEL_FOUT1_Msk

#define    GPIO_EXTISEL0_EXTI0_Pos                                (0U)
#define    GPIO_EXTISEL0_EXTI0_Msk                                (0x3U << GPIO_EXTISEL0_EXTI0_Pos)
#define    GPIO_EXTISEL0_EXTI0                                    GPIO_EXTISEL0_EXTI0_Msk

#define    GPIO_EXTISEL0_EXTI1_Pos                                (2U)
#define    GPIO_EXTISEL0_EXTI1_Msk                                (0x3U << GPIO_EXTISEL0_EXTI1_Pos)
#define    GPIO_EXTISEL0_EXTI1                                    GPIO_EXTISEL0_EXTI1_Msk

#define    GPIO_EXTISEL0_EXTI2_Pos                                (4U)
#define    GPIO_EXTISEL0_EXTI2_Msk                                (0x3U << GPIO_EXTISEL0_EXTI2_Pos)
#define    GPIO_EXTISEL0_EXTI2                                    GPIO_EXTISEL0_EXTI2_Msk

#define    GPIO_EXTISEL0_EXTI3_Pos                                (6U)
#define    GPIO_EXTISEL0_EXTI3_Msk                                (0x3U << GPIO_EXTISEL0_EXTI3_Pos)
#define    GPIO_EXTISEL0_EXTI3                                    GPIO_EXTISEL0_EXTI3_Msk

#define    GPIO_EXTISEL0_EXTI4_Pos                                (8U)
#define    GPIO_EXTISEL0_EXTI4_Msk                                (0x3U << GPIO_EXTISEL0_EXTI4_Pos)
#define    GPIO_EXTISEL0_EXTI4                                    GPIO_EXTISEL0_EXTI4_Msk

#define    GPIO_EXTISEL0_EXTI5_Pos                                (10U)
#define    GPIO_EXTISEL0_EXTI5_Msk                                (0x3U << GPIO_EXTISEL0_EXTI5_Pos)
#define    GPIO_EXTISEL0_EXTI5                                    GPIO_EXTISEL0_EXTI5_Msk

#define    GPIO_EXTISEL0_EXTI6_Pos                                (12U)
#define    GPIO_EXTISEL0_EXTI6_Msk                                (0x3U << GPIO_EXTISEL0_EXTI6_Pos)
#define    GPIO_EXTISEL0_EXTI6                                    GPIO_EXTISEL0_EXTI6_Msk

