GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/system_fm33lr0xx.h
#define    GPIO_EXTISEL0_EXTI7_Pos                                (14U)
#define    GPIO_EXTISEL0_EXTI7_Msk                                (0x3U << GPIO_EXTISEL0_EXTI7_Pos)
#define    GPIO_EXTISEL0_EXTI7                                    GPIO_EXTISEL0_EXTI7_Msk

#define    GPIO_EXTISEL0_EXTI8_Pos                                (16U)
#define    GPIO_EXTISEL0_EXTI8_Msk                                (0x3U << GPIO_EXTISEL0_EXTI8_Pos)
#define    GPIO_EXTISEL0_EXTI8                                    GPIO_EXTISEL0_EXTI8_Msk

#define    GPIO_EXTISEL0_EXTI9_Pos                                (18U)
#define    GPIO_EXTISEL0_EXTI9_Msk                                (0x3U << GPIO_EXTISEL0_EXTI9_Pos)
#define    GPIO_EXTISEL0_EXTI9                                    GPIO_EXTISEL0_EXTI9_Msk

#define    GPIO_EXTISEL0_EXTI10_Pos                               (20U)
#define    GPIO_EXTISEL0_EXTI10_Msk                               (0x3U << GPIO_EXTISEL0_EXTI10_Pos)
#define    GPIO_EXTISEL0_EXTI10                                   GPIO_EXTISEL0_EXTI10_Msk

#define    GPIO_EXTISEL0_EXTI11_Pos                               (22U)
#define    GPIO_EXTISEL0_EXTI11_Msk                               (0x3U << GPIO_EXTISEL0_EXTI11_Pos)
#define    GPIO_EXTISEL0_EXTI11                                   GPIO_EXTISEL0_EXTI11_Msk

#define    GPIO_EXTISEL0_EXTI12_Pos                               (24U)
#define    GPIO_EXTISEL0_EXTI12_Msk                               (0x3U << GPIO_EXTISEL0_EXTI12_Pos)
#define    GPIO_EXTISEL0_EXTI12                                   GPIO_EXTISEL0_EXTI12_Msk

#define    GPIO_EXTISEL0_EXTI13_Pos                               (26U)
#define    GPIO_EXTISEL0_EXTI13_Msk                               (0x3U << GPIO_EXTISEL0_EXTI13_Pos)
#define    GPIO_EXTISEL0_EXTI13                                   GPIO_EXTISEL0_EXTI13_Msk

#define    GPIO_EXTISEL0_EXTI14_Pos                               (28U)
#define    GPIO_EXTISEL0_EXTI14_Msk                               (0x3U << GPIO_EXTISEL0_EXTI14_Pos)
#define    GPIO_EXTISEL0_EXTI14                                   GPIO_EXTISEL0_EXTI14_Msk

#define    GPIO_EXTISEL0_EXTI15_Pos                               (30U)
#define    GPIO_EXTISEL0_EXTI15_Msk                               (0x3U << GPIO_EXTISEL0_EXTI15_Pos)
#define    GPIO_EXTISEL0_EXTI15                                   GPIO_EXTISEL0_EXTI15_Msk

#define    GPIO_EXTISEL1_EXTI16_Pos                               (0U)
#define    GPIO_EXTISEL1_EXTI16_Msk                               (0x3U << GPIO_EXTISEL1_EXTI16_Pos)
#define    GPIO_EXTISEL1_EXTI16                                   GPIO_EXTISEL1_EXTI16_Msk

#define    GPIO_EXTISEL1_EXTI17_Pos                               (2U)
#define    GPIO_EXTISEL1_EXTI17_Msk                               (0x3U << GPIO_EXTISEL1_EXTI17_Pos)
#define    GPIO_EXTISEL1_EXTI17                                   GPIO_EXTISEL1_EXTI17_Msk

#define    GPIO_EXTISEL1_EXTI18_Pos                               (4U)
#define    GPIO_EXTISEL1_EXTI18_Msk                               (0x3U << GPIO_EXTISEL1_EXTI18_Pos)
#define    GPIO_EXTISEL1_EXTI18                                   GPIO_EXTISEL1_EXTI18_Msk

#define    GPIO_PINWKEN_EN_Pos                                    (0U)
#define    GPIO_PINWKEN_EN_Msk                                    (0x3fU << GPIO_PINWKEN_EN_Pos)
#define    GPIO_PINWKEN_EN                                        GPIO_PINWKEN_EN_Msk

#define    GPIO_PINWKEN_WKSEL_Pos                                 (31U)
#define    GPIO_PINWKEN_WKSEL_Msk                                 (0x1U << GPIO_PINWKEN_WKSEL_Pos)
#define    GPIO_PINWKEN_WKSEL                                     GPIO_PINWKEN_WKSEL_Msk

#define    GPIO_PINWKEN_SEL_Pos                                   (10U)
#define    GPIO_PINWKEN_SEL_Msk                                   (0x3U << GPIO_PINWKEN_SEL_Pos)
#define    GPIO_PINWKEN_SEL                                       GPIO_PINWKEN_SEL_Msk



#define    FL_GPIO_PIN_0                                          (0x1U << 0U)
#define    FL_GPIO_PIN_1                                          (0x1U << 1U)
#define    FL_GPIO_PIN_2                                          (0x1U << 2U)
#define    FL_GPIO_PIN_3                                          (0x1U << 3U)
#define    FL_GPIO_PIN_4                                          (0x1U << 4U)
#define    FL_GPIO_PIN_5                                          (0x1U << 5U)
#define    FL_GPIO_PIN_6                                          (0x1U << 6U)
#define    FL_GPIO_PIN_7                                          (0x1U << 7U)
#define    FL_GPIO_PIN_8                                          (0x1U << 8U)
#define    FL_GPIO_PIN_9                                          (0x1U << 9U)
#define    FL_GPIO_PIN_10                                         (0x1U << 10U)
#define    FL_GPIO_PIN_11                                         (0x1U << 11U)
#define    FL_GPIO_PIN_12                                         (0x1U << 12U)
#define    FL_GPIO_PIN_13                                         (0x1U << 13U)
#define    FL_GPIO_PIN_14                                         (0x1U << 14U)
#define    FL_GPIO_PIN_15                                         (0x1U << 15U)
#define    FL_GPIO_PIN_ALL                                        (0xffffU << 0U)
#define    FL_GPIO_PIN_ALL_EXCEPTSWD                              0xFFE7U

#define    FL_GPIO_EXTI_LINE_0                                    (0x1U << 0U)
#define    FL_GPIO_EXTI_LINE_1                                    (0x1U << 1U)
#define    FL_GPIO_EXTI_LINE_2                                    (0x1U << 2U)
#define    FL_GPIO_EXTI_LINE_3                                    (0x1U << 3U)
#define    FL_GPIO_EXTI_LINE_4                                    (0x1U << 4U)
#define    FL_GPIO_EXTI_LINE_5                                    (0x1U << 5U)
#define    FL_GPIO_EXTI_LINE_6                                    (0x1U << 6U)
#define    FL_GPIO_EXTI_LINE_7                                    (0x1U << 7U)
#define    FL_GPIO_EXTI_LINE_8                                    (0x1U << 8U)
#define    FL_GPIO_EXTI_LINE_9                                    (0x1U << 9U)
#define    FL_GPIO_EXTI_LINE_10                                   (0x1U << 10U)
#define    FL_GPIO_EXTI_LINE_11                                   (0x1U << 11U)
#define    FL_GPIO_EXTI_LINE_12                                   (0x1U << 12U)
#define    FL_GPIO_EXTI_LINE_13                                   (0x1U << 13U)
#define    FL_GPIO_EXTI_LINE_14                                   (0x1U << 14U)
#define    FL_GPIO_EXTI_LINE_15                                   (0x1U << 15U)
#define    FL_GPIO_EXTI_LINE_16                                   (0x1U << 16U)
#define    FL_GPIO_EXTI_LINE_17                                   (0x1U << 17U)
#define    FL_GPIO_EXTI_LINE_18                                   (0x1U << 18U)
#define    FL_GPIO_EXTI_LINE_ALL                                  (0x3fffffU << 0U)

#define    FL_GPIO_EXTI_LINE_0_PA0                                (0x0U << 0U)
#define    FL_GPIO_EXTI_LINE_0_PA1                                (0x1U << 0U)
#define    FL_GPIO_EXTI_LINE_0_PA2                                (0x2U << 0U)
#define    FL_GPIO_EXTI_LINE_0_PA3                                (0x3U << 0U)
#define    FL_GPIO_EXTI_LINE_1_PA4                                (0x0U << 2U)
#define    FL_GPIO_EXTI_LINE_1_PA5                                (0x1U << 2U)
#define    FL_GPIO_EXTI_LINE_1_PA6                                (0x2U << 2U)
#define    FL_GPIO_EXTI_LINE_1_PA7                                (0x3U << 2U)
#define    FL_GPIO_EXTI_LINE_2_PA8                                (0x0U << 4U)
#define    FL_GPIO_EXTI_LINE_2_PA9                                (0x1U << 4U)
#define    FL_GPIO_EXTI_LINE_2_PA10                               (0x2U << 4U)
#define    FL_GPIO_EXTI_LINE_2_PA11                               (0x3U << 4U)
#define    FL_GPIO_EXTI_LINE_3_PA12                               (0x0U << 6U)
#define    FL_GPIO_EXTI_LINE_3_PA13                               (0x1U << 6U)
#define    FL_GPIO_EXTI_LINE_3_PA14                               (0x2U << 6U)
#define    FL_GPIO_EXTI_LINE_3_PA15                               (0x3U << 6U)
#define    FL_GPIO_EXTI_LINE_4_PB0                                (0x0U << 8U)
#define    FL_GPIO_EXTI_LINE_4_PB1                                (0x1U << 8U)
#define    FL_GPIO_EXTI_LINE_4_PB2                                (0x2U << 8U)
#define    FL_GPIO_EXTI_LINE_4_PB3                                (0x3U << 8U)
#define    FL_GPIO_EXTI_LINE_5_PB4                                (0x0U << 10U)
#define    FL_GPIO_EXTI_LINE_5_PB5                                (0x1U << 10U)
#define    FL_GPIO_EXTI_LINE_5_PB6                                (0x2U << 10U)
#define    FL_GPIO_EXTI_LINE_5_PB7                                (0x3U << 10U)
#define    FL_GPIO_EXTI_LINE_6_PB8                                (0x0U << 12U)
#define    FL_GPIO_EXTI_LINE_6_PB9                                (0x1U << 12U)
#define    FL_GPIO_EXTI_LINE_6_PB10                               (0x2U << 12U)
#define    FL_GPIO_EXTI_LINE_6_PB11                               (0x3U << 12U)
#define    FL_GPIO_EXTI_LINE_7_PB12                               (0x0U << 14U)
#define    FL_GPIO_EXTI_LINE_7_PB13                               (0x1U << 14U)
#define    FL_GPIO_EXTI_LINE_7_PB14                               (0x2U << 14U)
#define    FL_GPIO_EXTI_LINE_7_PB15                               (0x3U << 14U)
#define    FL_GPIO_EXTI_LINE_8_PC0                                (0x0U << 16U)
#define    FL_GPIO_EXTI_LINE_8_PC1                                (0x1U << 16U)
#define    FL_GPIO_EXTI_LINE_8_PC2                                (0x2U << 16U)
#define    FL_GPIO_EXTI_LINE_8_PC3                                (0x3U << 16U)
#define    FL_GPIO_EXTI_LINE_9_PC4                                (0x0U << 18U)
#define    FL_GPIO_EXTI_LINE_9_PC5                                (0x1U << 18U)
#define    FL_GPIO_EXTI_LINE_9_PC6                                (0x2U << 18U)
#define    FL_GPIO_EXTI_LINE_9_PC7                                (0x3U << 18U)
#define    FL_GPIO_EXTI_LINE_10_PC8                               (0x0U << 20U)
#define    FL_GPIO_EXTI_LINE_10_PC9                               (0x1U << 20U)
#define    FL_GPIO_EXTI_LINE_10_PC10                              (0x2U << 20U)
#define    FL_GPIO_EXTI_LINE_10_PC11                              (0x3U << 20U)
#define    FL_GPIO_EXTI_LINE_11_PC12                              (0x0U << 22U)
#define    FL_GPIO_EXTI_LINE_12_PD0                               (0x0U << 24U)
#define    FL_GPIO_EXTI_LINE_12_PD1                               (0x1U << 24U)
#define    FL_GPIO_EXTI_LINE_12_PD2                               (0x2U << 24U)
#define    FL_GPIO_EXTI_LINE_12_PD3                               (0x3U << 24U)
#define    FL_GPIO_EXTI_LINE_13_PD4                               (0x0U << 26U)
#define    FL_GPIO_EXTI_LINE_13_PD5                               (0x1U << 26U)
#define    FL_GPIO_EXTI_LINE_13_PD6                               (0x2U << 26U)
#define    FL_GPIO_EXTI_LINE_13_PD7                               (0x3U << 26U)
#define    FL_GPIO_EXTI_LINE_14_PD8                               (0x0U << 28U)
#define    FL_GPIO_EXTI_LINE_14_PD9                               (0x1U << 28U)
#define    FL_GPIO_EXTI_LINE_14_PD10                              (0x2U << 28U)
#define    FL_GPIO_EXTI_LINE_14_PD11                              (0x3U << 28U)
#define    FL_GPIO_EXTI_LINE_15_PD12                              (0x0U << 30U)
#define    FL_GPIO_EXTI_LINE_16_PE0                               (0x0U << 0U)
#define    FL_GPIO_EXTI_LINE_16_PE1                               (0x1U << 0U)
#define    FL_GPIO_EXTI_LINE_16_PE2                               (0x2U << 0U)
#define    FL_GPIO_EXTI_LINE_16_PE3                               (0x3U << 0U)
#define    FL_GPIO_EXTI_LINE_17_PE4                               (0x0U << 2U)
#define    FL_GPIO_EXTI_LINE_17_PE5                               (0x1U << 2U)
#define    FL_GPIO_EXTI_LINE_17_PE6                               (0x2U << 2U)
#define    FL_GPIO_EXTI_LINE_17_PE7                               (0x3U << 2U)
#define    FL_GPIO_EXTI_LINE_18_PE8                               (0x0U << 4U)
#define    FL_GPIO_EXTI_LINE_18_PE9                               (0x1U << 4U)
#define    FL_GPIO_EXTI_LINE_18_PE10                              (0x2U << 4U)
#define    FL_GPIO_EXTI_LINE_18_PE11                              (0x3U << 4U)
#define    FL_GPIO_WAKEUP_0                                       (0x1U << 0U)
#define    FL_GPIO_WAKEUP_1                                       (0x1U << 1U)
#define    FL_GPIO_WAKEUP_2                                       (0x1U << 2U)
#define    FL_GPIO_WAKEUP_3                                       (0x1U << 3U)
#define    FL_GPIO_WAKEUP_4                                       (0x1U << 4U)
#define    FL_GPIO_WAKEUP_5                                       (0x1U << 5U)

#define    FL_GPIO_OUTPUT_PUSHPULL                                0x0U
#define    FL_GPIO_OUTPUT_OPENDRAIN                               0x1U

