GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/system_fm33lr0xx.h
#define    FL_GPIO_PULLUP_ENABLE                                  (0x0U << GPIO_PUDEN_PUD_Pos)
#define    FL_GPIO_PULLDOWN_ENABLE                                (0x1U << GPIO_PUDEN_PUD_Pos)
#define    FL_GPIO_BOTH_DISABLE                                   0x2U

#define    FL_GPIO_MODE_INPUT                                     (0x0U << GPIO_FCR_Pos)
#define    FL_GPIO_MODE_OUTPUT                                    (0x1U << GPIO_FCR_Pos)
#define    FL_GPIO_MODE_DIGITAL                                   (0x2U << GPIO_FCR_Pos)
#define    FL_GPIO_MODE_ANALOG                                    (0x3U << GPIO_FCR_Pos)


#define    FL_GPIO_PINREMAP_FUNCTON1                              (0x0U << GPIO_DFS_Pos)
#define    FL_GPIO_PINREMAP_FUNCTON2                              (0x1U << GPIO_DFS_Pos)
#define    FL_GPIO_PINREMAP_FUNCTON3                              (0x2U << GPIO_DFS_Pos)
#define    FL_GPIO_PINREMAP_FUNCTON4                              (0x3U << GPIO_DFS_Pos)


#define    FL_GPIO_DRIVESTRENGTH_HIGH                             (0x0U << GPIO_SRDR_DR_Pos)
#define    FL_GPIO_DRIVESTRENGTH_LOW                              (0x1U << GPIO_SRDR_DR_Pos)

#define    FL_GPIO_SLEWRATE_HIGH                                  (0x0U << GPIO_SRDR_SR_Pos)
#define    FL_GPIO_SLEWRATE_LOW                                   (0x1U << GPIO_SRDR_SR_Pos)


#define    FL_GPIO_CHSEL_ATIM_CH4N                                (0x0U << GPIO_TMUXR_PC8TMUX_Pos)
#define    FL_GPIO_CHSEL_TI07                                     (0x1U << GPIO_TMUXR_PC8TMUX_Pos)
#define    FL_GPIO_CHSEL_TO07                                     (0x2U << GPIO_TMUXR_PC8TMUX_Pos)


#define    FL_GPIO_CHSEL_ATIM_CH3N                                (0x0U << GPIO_TMUXR_PC7TMUX_Pos)
#define    FL_GPIO_CHSEL_TI06                                     (0x1U << GPIO_TMUXR_PC7TMUX_Pos)
#define    FL_GPIO_CHSEL_TO06                                     (0x2U << GPIO_TMUXR_PC7TMUX_Pos)


#define    FL_GPIO_CHSEL_ATIM_CH2N                                (0x0U << GPIO_TMUXR_PC6TMUX_Pos)
#define    FL_GPIO_CHSEL_TI05                                     (0x1U << GPIO_TMUXR_PC6TMUX_Pos)
#define    FL_GPIO_CHSEL_TO05                                     (0x2U << GPIO_TMUXR_PC6TMUX_Pos)


#define    FL_GPIO_CHSEL_ATIM_CH1N                                (0x0U << GPIO_TMUXR_PC5TMUX_Pos)
#define    FL_GPIO_CHSEL_TI04                                     (0x1U << GPIO_TMUXR_PC5TMUX_Pos)
#define    FL_GPIO_CHSEL_TO04                                     (0x2U << GPIO_TMUXR_PC5TMUX_Pos)


#define    FL_GPIO_CHSEL_ATIM_CH4                                 (0x0U << GPIO_TMUXR_PC4TMUX_Pos)
#define    FL_GPIO_CHSEL_TI03                                     (0x1U << GPIO_TMUXR_PC4TMUX_Pos)
#define    FL_GPIO_CHSEL_TO03                                     (0x2U << GPIO_TMUXR_PC4TMUX_Pos)


#define    FL_GPIO_CHSEL_ATIM_CH3                                 (0x0U << GPIO_TMUXR_PC3TMUX_Pos)
#define    FL_GPIO_CHSEL_TI02                                     (0x1U << GPIO_TMUXR_PC3TMUX_Pos)
#define    FL_GPIO_CHSEL_TO02                                     (0x2U << GPIO_TMUXR_PC3TMUX_Pos)


#define    FL_GPIO_CHSEL_ATIM_CH2                                 (0x0U << GPIO_TMUXR_PC2TMUX_Pos)
#define    FL_GPIO_CHSEL_TI01                                     (0x1U << GPIO_TMUXR_PC2TMUX_Pos)
#define    FL_GPIO_CHSEL_TO01                                     (0x2U << GPIO_TMUXR_PC2TMUX_Pos)


#define    FL_GPIO_CHSEL_ATIM_CH1                                 (0x0U << GPIO_TMUXR_PC1TMUX_Pos)
#define    FL_GPIO_CHSEL_TI00                                     (0x1U << GPIO_TMUXR_PC1TMUX_Pos)
#define    FL_GPIO_CHSEL_TO00                                     (0x2U << GPIO_TMUXR_PC1TMUX_Pos)


#define    FL_GPIO_EXTI_TRIGGER_EDGE_RISING                       (0x0U << GPIO_EXTIEDS0_Pos)
#define    FL_GPIO_EXTI_TRIGGER_EDGE_FALLING                      (0x1U << GPIO_EXTIEDS0_Pos)
#define    FL_GPIO_EXTI_TRIGGER_EDGE_BOTH                         (0x2U << GPIO_EXTIEDS0_Pos)
#define    FL_GPIO_EXTI_TRIGGER_EDGE_DISABLE                      (0x3U << GPIO_EXTIEDS0_Pos)


#define    FL_GPIO_FOUT0_SELECT_ADC_SOC                           (0x0U << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_RCLP                              (0x1U << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_RCHF_DIV64                        (0x2U << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_ADCCLK                            (0x3U << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_AHBCLK_DIV64                      (0x4U << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_PLLOUTPUT_DIV64                   (0x6U << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_EOC                               (0x7U << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_APBCLK_DIV64                      (0x8U << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_PLLOUTPUT                         (0x9U << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_RCHF                              (0xbU << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_XTHF_DIV64                        (0xcU << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_CLK_8K                            (0xeU << GPIO_FOUTSEL_FOUT0_Pos)
#define    FL_GPIO_FOUT0_SELECT_APBCLK                            (0xfU << GPIO_FOUTSEL_FOUT0_Pos)


#define    FL_GPIO_FOUT1_SELECT_ADCCLK                            (0x0U << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_RCLP                              (0x1U << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_APBCLK                            (0x2U << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_EOC                               (0x4U << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_PLLOUTPUT_DIV64                   (0x6U << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_SOC                               (0x7U << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_APBCLK_DIV64                      (0x8U << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_PLLOUTPUT                         (0x9U << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_RCHF                              (0xbU << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_XTHF_DIV64                        (0xcU << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_ADCCLK_DIV64                      (0xdU << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_CLK_8K                            (0xeU << GPIO_FOUTSEL_FOUT1_Pos)
#define    FL_GPIO_FOUT1_SELECT_XTHF                              (0xfU << GPIO_FOUTSEL_FOUT1_Pos)


#define    FL_GPIO_WAKEUP_INT_ENTRY_NMI                           (0x0U << GPIO_PINWKEN_WKSEL_Pos)
#define    FL_GPIO_WAKEUP_INT_ENTRY_39                            (0x1U << GPIO_PINWKEN_WKSEL_Pos)


#define    FL_GPIO_WAKEUP_TRIGGER_FALLING                         (0x0U << GPIO_PINWKEN_SEL_Pos)
#define    FL_GPIO_WAKEUP_TRIGGER_RISING                          (0x1U << GPIO_PINWKEN_SEL_Pos)
#define    FL_GPIO_WAKEUP_TRIGGER_BOTH                            (0x2U << GPIO_PINWKEN_SEL_Pos)
/* GPIO end --------------------------------------------*/

/* INTMUX start --------------------------------------------*/
#define    INTMUX_CR_MUX13SEL_Pos                                 (26U)
#define    INTMUX_CR_MUX13SEL_Msk                                 (0x3U << INTMUX_CR_MUX13SEL_Pos)
#define    INTMUX_CR_MUX13SEL                                     INTMUX_CR_MUX13SEL_Msk

#define    INTMUX_CR_MUX12SEL_Pos                                 (24U)
#define    INTMUX_CR_MUX12SEL_Msk                                 (0x3U << INTMUX_CR_MUX12SEL_Pos)
#define    INTMUX_CR_MUX12SEL                                     INTMUX_CR_MUX12SEL_Msk

#define    INTMUX_CR_MUX11SEL_Pos                                 (22U)
#define    INTMUX_CR_MUX11SEL_Msk                                 (0x3U << INTMUX_CR_MUX11SEL_Pos)
#define    INTMUX_CR_MUX11SEL                                     INTMUX_CR_MUX11SEL_Msk

#define    INTMUX_CR_MUX10SEL_Pos                                 (20U)
#define    INTMUX_CR_MUX10SEL_Msk                                 (0x3U << INTMUX_CR_MUX10SEL_Pos)
#define    INTMUX_CR_MUX10SEL                                     INTMUX_CR_MUX10SEL_Msk

