GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/system_fm33lr0xx.h
#define    INTMUX_CR_MUX9SEL_Pos                                  (18U)
#define    INTMUX_CR_MUX9SEL_Msk                                  (0x3U << INTMUX_CR_MUX9SEL_Pos)
#define    INTMUX_CR_MUX9SEL                                      INTMUX_CR_MUX9SEL_Msk

#define    INTMUX_CR_MUX8SEL_Pos                                  (16U)
#define    INTMUX_CR_MUX8SEL_Msk                                  (0x3U << INTMUX_CR_MUX8SEL_Pos)
#define    INTMUX_CR_MUX8SEL                                      INTMUX_CR_MUX8SEL_Msk

#define    INTMUX_CR_MUX7SEL_Pos                                  (14U)
#define    INTMUX_CR_MUX7SEL_Msk                                  (0x3U << INTMUX_CR_MUX7SEL_Pos)
#define    INTMUX_CR_MUX7SEL                                      INTMUX_CR_MUX7SEL_Msk

#define    INTMUX_CR_MUX6SEL_Pos                                  (12U)
#define    INTMUX_CR_MUX6SEL_Msk                                  (0x3U << INTMUX_CR_MUX6SEL_Pos)
#define    INTMUX_CR_MUX6SEL                                      INTMUX_CR_MUX6SEL_Msk

#define    INTMUX_CR_MUX5SEL_Pos                                  (10U)
#define    INTMUX_CR_MUX5SEL_Msk                                  (0x3U << INTMUX_CR_MUX5SEL_Pos)
#define    INTMUX_CR_MUX5SEL                                      INTMUX_CR_MUX5SEL_Msk

#define    INTMUX_CR_MUX4SEL_Pos                                  (8U)
#define    INTMUX_CR_MUX4SEL_Msk                                  (0x3U << INTMUX_CR_MUX4SEL_Pos)
#define    INTMUX_CR_MUX4SEL                                      INTMUX_CR_MUX4SEL_Msk

#define    INTMUX_CR_MUX3SEL_Pos                                  (6U)
#define    INTMUX_CR_MUX3SEL_Msk                                  (0x3U << INTMUX_CR_MUX3SEL_Pos)
#define    INTMUX_CR_MUX3SEL                                      INTMUX_CR_MUX3SEL_Msk

#define    INTMUX_CR_MUX2SEL_Pos                                  (4U)
#define    INTMUX_CR_MUX2SEL_Msk                                  (0x3U << INTMUX_CR_MUX2SEL_Pos)
#define    INTMUX_CR_MUX2SEL                                      INTMUX_CR_MUX2SEL_Msk

#define    INTMUX_CR_MUX1SEL_Pos                                  (2U)
#define    INTMUX_CR_MUX1SEL_Msk                                  (0x3U << INTMUX_CR_MUX1SEL_Pos)
#define    INTMUX_CR_MUX1SEL                                      INTMUX_CR_MUX1SEL_Msk

#define    INTMUX_CR_MUX0SEL_Pos                                  (0U)
#define    INTMUX_CR_MUX0SEL_Msk                                  (0x3U << INTMUX_CR_MUX0SEL_Pos)
#define    INTMUX_CR_MUX0SEL                                      INTMUX_CR_MUX0SEL_Msk



#define    FL_INTMUX_MUX13SEL_TAU00                               (0x0U << INTMUX_CR_MUX13SEL_Pos)
#define    FL_INTMUX_MUX13SEL_UART1                               (0x1U << INTMUX_CR_MUX13SEL_Pos)
#define    FL_INTMUX_MUX13SEL_UART2                               (0x2U << INTMUX_CR_MUX13SEL_Pos)
#define    FL_INTMUX_MUX13SEL_CAN1                                (0x3U << INTMUX_CR_MUX13SEL_Pos)


#define    FL_INTMUX_MUX12SEL_SPI3                                (0x0U << INTMUX_CR_MUX12SEL_Pos)
#define    FL_INTMUX_MUX12SEL_TAU13                               (0x1U << INTMUX_CR_MUX12SEL_Pos)
#define    FL_INTMUX_MUX12SEL_TAU05                               (0x2U << INTMUX_CR_MUX12SEL_Pos)
#define    FL_INTMUX_MUX12SEL_TAU07                               (0x3U << INTMUX_CR_MUX12SEL_Pos)


#define    FL_INTMUX_MUX11SEL_SPI2                                (0x0U << INTMUX_CR_MUX11SEL_Pos)
#define    FL_INTMUX_MUX11SEL_TAU11                               (0x1U << INTMUX_CR_MUX11SEL_Pos)
#define    FL_INTMUX_MUX11SEL_TAU04                               (0x2U << INTMUX_CR_MUX11SEL_Pos)
#define    FL_INTMUX_MUX11SEL_TAU03                               (0x3U << INTMUX_CR_MUX11SEL_Pos)


#define    FL_INTMUX_MUX10SEL_LUT                                 (0x0U << INTMUX_CR_MUX10SEL_Pos)
#define    FL_INTMUX_MUX10SEL_TAU03                               (0x1U << INTMUX_CR_MUX10SEL_Pos)
#define    FL_INTMUX_MUX10SEL_TAU04                               (0x2U << INTMUX_CR_MUX10SEL_Pos)
#define    FL_INTMUX_MUX10SEL_TAU07                               (0x3U << INTMUX_CR_MUX10SEL_Pos)


#define    FL_INTMUX_MUX9SEL_CCL                                  (0x0U << INTMUX_CR_MUX9SEL_Pos)
#define    FL_INTMUX_MUX9SEL_TAU05                                (0x1U << INTMUX_CR_MUX9SEL_Pos)
#define    FL_INTMUX_MUX9SEL_TAU06                                (0x2U << INTMUX_CR_MUX9SEL_Pos)
#define    FL_INTMUX_MUX9SEL_TAU03                                (0x3U << INTMUX_CR_MUX9SEL_Pos)


#define    FL_INTMUX_MUX8SEL_UART5                                (0x0U << INTMUX_CR_MUX8SEL_Pos)
#define    FL_INTMUX_MUX8SEL_TAU05                                (0x1U << INTMUX_CR_MUX8SEL_Pos)
#define    FL_INTMUX_MUX8SEL_TAU06                                (0x2U << INTMUX_CR_MUX8SEL_Pos)
#define    FL_INTMUX_MUX8SEL_TAU12                                (0x3U << INTMUX_CR_MUX8SEL_Pos)


#define    FL_INTMUX_MUX7SEL_UART4                                (0x0U << INTMUX_CR_MUX7SEL_Pos)
#define    FL_INTMUX_MUX7SEL_TAU12                                (0x1U << INTMUX_CR_MUX7SEL_Pos)
#define    FL_INTMUX_MUX7SEL_TAU13                                (0x2U << INTMUX_CR_MUX7SEL_Pos)
#define    FL_INTMUX_MUX7SEL_TAU04                                (0x3U << INTMUX_CR_MUX7SEL_Pos)


#define    FL_INTMUX_MUX6SEL_UART3                                (0x0U << INTMUX_CR_MUX6SEL_Pos)
#define    FL_INTMUX_MUX6SEL_TAU12                                (0x1U << INTMUX_CR_MUX6SEL_Pos)
#define    FL_INTMUX_MUX6SEL_TAU13                                (0x2U << INTMUX_CR_MUX6SEL_Pos)
#define    FL_INTMUX_MUX6SEL_TAU02                                (0x3U << INTMUX_CR_MUX6SEL_Pos)

#define    FL_INTMUX_MUX5SEL_UART2                                (0x0U << INTMUX_CR_MUX5SEL_Pos)
#define    FL_INTMUX_MUX5SEL_TAU03                                (0x1U << INTMUX_CR_MUX5SEL_Pos)
#define    FL_INTMUX_MUX5SEL_TAU04                                (0x2U << INTMUX_CR_MUX5SEL_Pos)
#define    FL_INTMUX_MUX5SEL_TAU11                                (0x3U << INTMUX_CR_MUX5SEL_Pos)


