GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/system_fm33lr0xx.h
#define    FL_INTMUX_MUX4SEL_UART1                                (0x0U << INTMUX_CR_MUX4SEL_Pos)
#define    FL_INTMUX_MUX4SEL_TAU00                                (0x1U << INTMUX_CR_MUX4SEL_Pos)
#define    FL_INTMUX_MUX4SEL_TAU01                                (0x2U << INTMUX_CR_MUX4SEL_Pos)
#define    FL_INTMUX_MUX4SEL_TAU10                                (0x3U << INTMUX_CR_MUX4SEL_Pos)


#define    FL_INTMUX_MUX3SEL_UART0                                (0x0U << INTMUX_CR_MUX3SEL_Pos)
#define    FL_INTMUX_MUX3SEL_TAU10                                (0x1U << INTMUX_CR_MUX3SEL_Pos)
#define    FL_INTMUX_MUX3SEL_TAU11                                (0x2U << INTMUX_CR_MUX3SEL_Pos)
#define    FL_INTMUX_MUX3SEL_TAU01                                (0x3U << INTMUX_CR_MUX3SEL_Pos)


#define    FL_INTMUX_MUX2SEL_SPI1                                 (0x0U << INTMUX_CR_MUX2SEL_Pos)
#define    FL_INTMUX_MUX2SEL_TAU12                                (0x1U << INTMUX_CR_MUX2SEL_Pos)
#define    FL_INTMUX_MUX2SEL_TAU01                                (0x2U << INTMUX_CR_MUX2SEL_Pos)
#define    FL_INTMUX_MUX2SEL_TAU02                                (0x3U << INTMUX_CR_MUX2SEL_Pos)


#define    FL_INTMUX_MUX1SEL_SPI0                                 (0x0U << INTMUX_CR_MUX1SEL_Pos)
#define    FL_INTMUX_MUX1SEL_TAU10                                (0x1U << INTMUX_CR_MUX1SEL_Pos)
#define    FL_INTMUX_MUX1SEL_TAU11                                (0x2U << INTMUX_CR_MUX1SEL_Pos)
#define    FL_INTMUX_MUX1SEL_TAU06                                (0x3U << INTMUX_CR_MUX1SEL_Pos)


#define    FL_INTMUX_MUX0SEL_FLASH                                (0x0U << INTMUX_CR_MUX0SEL_Pos)
#define    FL_INTMUX_MUX0SEL_TAU00                                (0x1U << INTMUX_CR_MUX0SEL_Pos)
#define    FL_INTMUX_MUX0SEL_TAU01                                (0x2U << INTMUX_CR_MUX0SEL_Pos)
#define    FL_INTMUX_MUX0SEL_TAU02                                (0x3U << INTMUX_CR_MUX0SEL_Pos)
/* INTMUX end --------------------------------------------*/

/* IWDT start --------------------------------------------*/
#define    IWDT_CR_FREEZE_Pos                                     (11U)
#define    IWDT_CR_FREEZE_Msk                                     (0x1U << IWDT_CR_FREEZE_Pos)
#define    IWDT_CR_FREEZE                                         IWDT_CR_FREEZE_Msk

#define    IWDT_CR_CFG_Pos                                        (0U)
#define    IWDT_CR_CFG_Msk                                        (0x7U << IWDT_CR_CFG_Pos)
#define    IWDT_CR_CFG                                            IWDT_CR_CFG_Msk

#define    IWDT_IER_IE_Pos                                        (0U)
#define    IWDT_IER_IE_Msk                                        (0x1U << IWDT_IER_IE_Pos)
#define    IWDT_IER_IE                                            IWDT_IER_IE_Msk

#define    IWDT_ISR_WINF_Pos                                      (0U)
#define    IWDT_ISR_WINF_Msk                                      (0x1U << IWDT_ISR_WINF_Pos)
#define    IWDT_ISR_WINF                                          IWDT_ISR_WINF_Msk

#define    FL_IWDT_RELOAD_KEY                                     0x12345A5AU

#define    FL_IWDT_PERIOD_125MS                                   (0x0U << IWDT_CR_CFG_Pos)
#define    FL_IWDT_PERIOD_250MS                                   (0x1U << IWDT_CR_CFG_Pos)
#define    FL_IWDT_PERIOD_500MS                                   (0x2U << IWDT_CR_CFG_Pos)
#define    FL_IWDT_PERIOD_1000MS                                  (0x3U << IWDT_CR_CFG_Pos)
#define    FL_IWDT_PERIOD_2000MS                                  (0x4U << IWDT_CR_CFG_Pos)
#define    FL_IWDT_PERIOD_4000MS                                  (0x5U << IWDT_CR_CFG_Pos)
#define    FL_IWDT_PERIOD_8000MS                                  (0x6U << IWDT_CR_CFG_Pos)
#define    FL_IWDT_PERIOD_16000MS                                 (0x7U << IWDT_CR_CFG_Pos)
/* IWDT end --------------------------------------------*/

/* LPTIM start --------------------------------------------*/
#define    LPTIM16_CR_EN_Pos                                      (0U)
#define    LPTIM16_CR_EN_Msk                                      (0x1U << LPTIM16_CR_EN_Pos)
#define    LPTIM16_CR_EN                                          LPTIM16_CR_EN_Msk

#define    LPTIM16_CFGR_ETR_AFEN_Pos                              (24U)
#define    LPTIM16_CFGR_ETR_AFEN_Msk                              (0x1U << LPTIM16_CFGR_ETR_AFEN_Pos)
#define    LPTIM16_CFGR_ETR_AFEN                                  LPTIM16_CFGR_ETR_AFEN_Msk

#define    LPTIM16_CFGR_MMS_Pos                                   (16U)
#define    LPTIM16_CFGR_MMS_Msk                                   (0x7U << LPTIM16_CFGR_MMS_Pos)
#define    LPTIM16_CFGR_MMS                                       LPTIM16_CFGR_MMS_Msk

#define    LPTIM16_CFGR_PSCSEL_Pos                                (14U)
#define    LPTIM16_CFGR_PSCSEL_Msk                                (0x1U << LPTIM16_CFGR_PSCSEL_Pos)
#define    LPTIM16_CFGR_PSCSEL                                    LPTIM16_CFGR_PSCSEL_Msk

#define    LPTIM16_CFGR_DIVSEL_Pos                                (10U)
#define    LPTIM16_CFGR_DIVSEL_Msk                                (0x7U << LPTIM16_CFGR_DIVSEL_Pos)
#define    LPTIM16_CFGR_DIVSEL                                    LPTIM16_CFGR_DIVSEL_Msk

#define    LPTIM16_CFGR_EDGESEL_Pos                               (7U)
#define    LPTIM16_CFGR_EDGESEL_Msk                               (0x1U << LPTIM16_CFGR_EDGESEL_Pos)
#define    LPTIM16_CFGR_EDGESEL                                   LPTIM16_CFGR_EDGESEL_Msk

#define    LPTIM16_CFGR_TRIGCFG_Pos                               (5U)
#define    LPTIM16_CFGR_TRIGCFG_Msk                               (0x3U << LPTIM16_CFGR_TRIGCFG_Pos)
#define    LPTIM16_CFGR_TRIGCFG                                   LPTIM16_CFGR_TRIGCFG_Msk

#define    LPTIM16_CFGR_QEMD_Pos                                  (3U)
#define    LPTIM16_CFGR_QEMD_Msk                                  (0x3U << LPTIM16_CFGR_QEMD_Pos)
#define    LPTIM16_CFGR_QEMD                                      LPTIM16_CFGR_QEMD_Msk

#define    LPTIM16_CFGR_ONST_Pos                                  (2U)
#define    LPTIM16_CFGR_ONST_Msk                                  (0x1U << LPTIM16_CFGR_ONST_Pos)
#define    LPTIM16_CFGR_ONST                                      LPTIM16_CFGR_ONST_Msk

