GUdaoxi/LR_project1/Drivers/CMSIS/Device/FM/FM33xx/Include/system_fm33lr0xx.h
#define    UART_ISR_LINWKTF_Pos                                   (23U)
#define    UART_ISR_LINWKTF_Msk                                   (0x1U << UART_ISR_LINWKTF_Pos)
#define    UART_ISR_LINWKTF                                       UART_ISR_LINWKTF_Msk

#define    UART_ISR_LINBEF_Pos                                    (22U)
#define    UART_ISR_LINBEF_Msk                                    (0x1U << UART_ISR_LINBEF_Pos)
#define    UART_ISR_LINBEF                                        UART_ISR_LINBEF_Msk

#define    UART_ISR_LINBER_Pos                                    (21U)
#define    UART_ISR_LINBER_Msk                                    (0x1U << UART_ISR_LINBER_Pos)
#define    UART_ISR_LINBER                                        UART_ISR_LINBER_Msk

#define    UART_ISR_PERR_Pos                                      (18U)
#define    UART_ISR_PERR_Msk                                      (0x1U << UART_ISR_PERR_Pos)
#define    UART_ISR_PERR                                          UART_ISR_PERR_Msk

#define    UART_ISR_FERR_Pos                                      (17U)
#define    UART_ISR_FERR_Msk                                      (0x1U << UART_ISR_FERR_Pos)
#define    UART_ISR_FERR                                          UART_ISR_FERR_Msk

#define    UART_ISR_OERR_Pos                                      (16U)
#define    UART_ISR_OERR_Msk                                      (0x1U << UART_ISR_OERR_Pos)
#define    UART_ISR_OERR                                          UART_ISR_OERR_Msk

#define    UART_ISR_RXTO_Pos                                      (11U)
#define    UART_ISR_RXTO_Msk                                      (0x1U << UART_ISR_RXTO_Pos)
#define    UART_ISR_RXTO                                          UART_ISR_RXTO_Msk

#define    UART_ISR_RXBF_Pos                                      (8U)
#define    UART_ISR_RXBF_Msk                                      (0x1U << UART_ISR_RXBF_Pos)
#define    UART_ISR_RXBF                                          UART_ISR_RXBF_Msk

#define    UART_ISR_NEWKF_Pos                                     (7U)
#define    UART_ISR_NEWKF_Msk                                     (0x1U << UART_ISR_NEWKF_Pos)
#define    UART_ISR_NEWKF                                         UART_ISR_NEWKF_Msk

#define    UART_ISR_TXOERR_Pos                                    (2U)
#define    UART_ISR_TXOERR_Msk                                    (0x1U << UART_ISR_TXOERR_Pos)
#define    UART_ISR_TXOERR                                        UART_ISR_TXOERR_Msk

#define    UART_ISR_TXBE_Pos                                      (1U)
#define    UART_ISR_TXBE_Msk                                      (0x1U << UART_ISR_TXBE_Pos)
#define    UART_ISR_TXBE                                          UART_ISR_TXBE_Msk

#define    UART_ISR_TXSE_Pos                                      (0U)
#define    UART_ISR_TXSE_Msk                                      (0x1U << UART_ISR_TXSE_Pos)
#define    UART_ISR_TXSE                                          UART_ISR_TXSE_Msk

#define    UART_TODR_TXDLY_LEN_Pos                                (8U)
#define    UART_TODR_TXDLY_LEN_Msk                                (0xffU << UART_TODR_TXDLY_LEN_Pos)
#define    UART_TODR_TXDLY_LEN                                    UART_TODR_TXDLY_LEN_Msk

#define    UART_TODR_RXTO_LEN_Pos                                 (0U)
#define    UART_TODR_RXTO_LEN_Msk                                 (0xffU << UART_TODR_RXTO_LEN_Pos)
#define    UART_TODR_RXTO_LEN                                     UART_TODR_RXTO_LEN_Msk

#define    UART_FFCR_ERSW_Pos                                      (9U)
#define    UART_FFCR_ERSW_Msk                                      (0x3U << UART_FFCR_ERSW_Pos)
#define    UART_FFCR_ERSW                                          UART_FFCR_ERSW_Msk

#define    UART_FFCR_ERSGD_Pos                                     (8U)
#define    UART_FFCR_ERSGD_Msk                                     (0x1U << UART_FFCR_ERSGD_Pos)
#define    UART_FFCR_ERSGD                                         UART_FFCR_ERSGD_Msk

#define    UART_FFCR_BGTEN_Pos                                     (7U)
#define    UART_FFCR_BGTEN_Msk                                     (0x1U << UART_FFCR_BGTEN_Pos)
#define    UART_FFCR_BGTEN                                         UART_FFCR_BGTEN_Msk

#define    UART_FFCR_REP_T_Pos                                     (6U)
#define    UART_FFCR_REP_T_Msk                                     (0x1U << UART_FFCR_REP_T_Pos)
#define    UART_FFCR_REP_T                                         UART_FFCR_REP_T_Msk

#define    UART_FFCR_PAR_Pos                                       (4U)
#define    UART_FFCR_PAR_Msk                                       (0x3U << UART_FFCR_PAR_Pos)
#define    UART_FFCR_PAR                                           UART_FFCR_PAR_Msk

#define    UART_FFCR_RFREN_Pos                                     (3U)
#define    UART_FFCR_RFREN_Msk                                     (0x1U << UART_FFCR_RFREN_Pos)
#define    UART_FFCR_RFREN                                         UART_FFCR_RFREN_Msk

#define    UART_FFCR_TREPEN_Pos                                    (2U)
#define    UART_FFCR_TREPEN_Msk                                    (0x1U << UART_FFCR_TREPEN_Pos)
#define    UART_FFCR_TREPEN                                        UART_FFCR_TREPEN_Msk

#define    UART_FFCR_RREPEN_Pos                                    (1U)
#define    UART_FFCR_RREPEN_Msk                                    (0x1U << UART_FFCR_RREPEN_Pos)
#define    UART_FFCR_RREPEN                                        UART_FFCR_RREPEN_Msk

#define    UART_FFCR_DICONV_Pos                                    (0U)
#define    UART_FFCR_DICONV_Msk                                    (0x1U << UART_FFCR_DICONV_Pos)
#define    UART_FFCR_DICONV                                        UART_FFCR_DICONV_Msk

#define    UART_SCIER_RXIE_Pos                                    (2U)
#define    UART_SCIER_RXIE_Msk                                    (0x1U << UART_SCIER_RXIE_Pos)
#define    UART_SCIER_RXIE                                        UART_SCIER_RXIE_Msk

#define    UART_SCIER_TXIE_Pos                                    (1U)
#define    UART_SCIER_TXIE_Msk                                    (0x1U << UART_SCIER_TXIE_Pos)
#define    UART_SCIER_TXIE                                        UART_SCIER_TXIE_Msk

